<template>
  <section style="position: relative;">
    <v-parallax
      height="650"
      src="defect.jpg"
    >
      <v-overlay
        absolute
        z-index="0"
      />
    </v-parallax>
    <div class="text-wrap">
      <div class="text-center display-1 white--text mb-6">
        Типовые неисправности мобильных телефонов
      </div>
      <v-row align="start" justify="center" wrap>
        <v-col
          v-for="(item, i) in items"
          :key="i"
          cols="12"
          md="5"
        >
          <v-card light tile>
            <v-card-text class="pa-8">
              <div class="title mb-3">
                {{ item.title }}
              </div>
              <!-- eslint-disable-next-line vue/no-v-html -->
              <div class="text--primary text-justify" v-html="item.text" />
            </v-card-text>
          </v-card>
        </v-col>
      </v-row>
    </div>
  </section>
</template>

<script>
export default {
  data () {
    return {
      items: [
        {
          title: 'Разбит экран',
          text: 'Не работает или разбит экран мобильного устройства. Существуют различные типы дисплеев для смартфонов. У одних экран состоит из дисплея и отдельной сенсорной панели, у других он выполнен в виде цельного модуля. В первом случае можно заменить какой-либо один компонент (сенсор или дисплей), а во втором придется менять модуль целиком.',
          icon: 'display.svg'
        },
        {
          title: 'Попадание жидкости',
          text: 'В подобной ситуации нужно быстро достать аккумуляторную батарею (если она легкосъёмная) и попытаться самостоятельно просушить телефон. Однако лучше всего показать смартфон специалистам сервисного центра. Даже если после попадания жидкости телефон продолжает работать, это не значит, что с ним все в порядке. Процесс окисления и коррозии может занять определённое время.',
          icon: 'cpu.svg'
        },
        {
          title: 'Быстро разряжается / Не включается',
          text: 'Эта проблема может появиться из-за целого ряда причин, начиная от банальной неисправности аккумулятора и заканчивая повреждением системной платы устройства. Возможно батарея отслужила свой срок и требует замены. Также возможен отказ во включении при ошибках в программном обеспечении.',
          icon: 'module.svg'
        },
        {
          title: 'Зависает и перезагружается',
          text: 'Сбои в программном обеспечении. Телефон может медленно работать, зависать при включении, циклично перезагружаться, могут отсутствовать какие-либо функции. В этом случае может помочь сброс до заводских настроек, если проблемы не исчезли, потребуется «перепрошивка» смартфона.',
          icon: 'h2o.svg'
        }
      ]
    }
  }
}
</script>

<style scoped>
  .text-wrap {
    position: absolute;
    top: 30px;
  }
</style>
