<template>
  <section style="position: relative;">
    <v-parallax
      height="650"
      src="defect.jpg"
    >
      <v-overlay
        absolute
        z-index="0"
      />
    </v-parallax>
    <div class="text-wrap">
      <div class="text-center display-1 white--text mb-6">
        Типовые неисправности мобильных телефонов
      </div>
      <v-row align="start" justify="center" wrap>
        <v-col
          v-for="(item, i) in items"
          :key="i"
          v-ripple
          cols="12"
          md="5"
        >
          <v-card light tile>
            <v-card-text class="pa-8">
              <div class="title mb-3">
                {{ item.title }}
              </div>
              <div class="text--primary text-justify">
                <!-- <v-img :src="item.icon" width="70" class="float-right ml-4" /> -->
                <!-- eslint-disable-next-line vue/no-v-html -->
                <div class="float-right ml-4 defects-icon" :class="item.color" v-html="item.icon" />
              </div>
              {{ item.text }}
            </v-card-text>
          </v-card>
        </v-col>
      </v-row>
    </div>
    </v-card-text>
    </v-card>
    </v-col>
    </v-row>
    </div>
  </section>
</template>

<script>
export default {
  data () {
    return {
      items: [
        {
          title: 'Разбит экран',
          text: 'Разбит или не работает экран мобильного устройства. Существуют различные типы дисплеев для смартфонов. У одних экран состоит из дисплея и отдельной сенсорной панели, у других он выполнен в виде цельного модуля. В первом случае можно заменить какой-либо один компонент (сенсор или дисплей), а во втором придется менять модуль целиком.',
          icon: '<svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="m19.5 24h-15c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h15c1.93 0 3.5-1.57 3.5-3.5v-5c0-.827-.673-1.5-1.5-1.5h-11c-.827 0-1.5.673-1.5 1.5 0 .276-.224.5-.5.5s-.5-.224-.5-.5c0-1.378 1.121-2.5 2.5-2.5h11c1.379 0 2.5 1.122 2.5 2.5v5c0 2.481-2.019 4.5-4.5 4.5z"/><path d="m4.5 24c-2.481 0-4.5-2.019-4.5-4.5v-17c0-1.378 1.121-2.5 2.5-2.5h11c1.379 0 2.5 1.122 2.5 2.5v10c0 .276-.224.5-.5.5s-.5-.224-.5-.5v-10c0-.827-.673-1.5-1.5-1.5h-11c-.827 0-1.5.673-1.5 1.5v17c0 1.93 1.57 3.5 3.5 3.5s3.5-1.57 3.5-3.5v-5c0-.276.224-.5.5-.5s.5.224.5.5v5c0 2.481-2.019 4.5-4.5 4.5z"/><path d="m8 7c-1.103 0-2-.897-2-2s.897-2 2-2 2 .897 2 2-.897 2-2 2zm0-3c-.552 0-1 .449-1 1s.448 1 1 1 1-.449 1-1-.448-1-1-1z"/><path d="m18 15h-4c-.827 0-1.5-.673-1.5-1.5 0-.276-.225-.5-.5-.5h-1c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h1c.827 0 1.5.673 1.5 1.5 0 .276.225.5.5.5h4c.275 0 .5-.224.5-.5 0-.827.673-1.5 1.5-1.5h1c.276 0 .5.224.5.5s-.224.5-.5.5h-1c-.275 0-.5.224-.5.5 0 .827-.673 1.5-1.5 1.5z"/></svg>',
          color: 'defects-icon-orange'
        },
        {
          title: 'Попадание жидкости',
          text: 'В подобной ситуации нужно быстро достать аккумуляторную батарею (если она легкосъёмная) и попытаться самостоятельно просушить телефон. Однако лучше всего показать смартфон специалистам сервисного центра. Даже если после попадания жидкости телефон продолжает работать, это не значит, что с ним все в порядке. Процесс окисления и коррозии может занять определённое время.',
          icon: '<svg enable-background="new 0 0 512.005 512.005" viewBox="0 0 512.005 512.005" xmlns="http://www.w3.org/2000/svg"><g><path d="m82.139 242.947c-23.303 29.104-36.137 66.059-36.137 104.058 0 90.981 74.019 165 165 165s165-74.019 165-165c0-38-12.834-74.955-36.137-104.058l-128.862-160.941zm263.864 104.058c0 74.439-60.561 135-135 135s-135-60.561-135-135c0-31.209 10.496-61.505 29.555-85.307l105.445-131.693 105.445 131.694c19.058 23.801 29.555 54.097 29.555 85.306z"/><path d="m136.003 347.005h-30c0 57.897 47.103 105 105 105v-30c-41.356 0-75-33.645-75-75z"/><path d="m466.003 121.005c0-17.22-5.654-33.387-16.352-46.759l-58.648-74.246-58.648 74.247c-10.697 13.371-16.352 29.539-16.352 46.759 0 41.355 33.645 75 75 75s75-33.646 75-75.001zm-120 0c0-10.347 3.389-20.045 9.801-28.047l35.199-44.56 35.199 44.56c6.412 8.001 9.801 17.699 9.801 28.047 0 24.813-20.187 45-45 45s-45-20.187-45-45z"/></g></svg>',
          color: 'defects-icon-blue'
        },
        {
          title: 'Быстро разряжается / Не включается',
          text: 'Эта проблема может появиться из-за целого ряда причин, начиная от банальной неисправности аккумулятора и заканчивая повреждением системной платы устройства. Возможно батарея отслужила свой срок и требует замены. Также возможен отказ во включении при ошибках в программном обеспечении.',
          icon: '<svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="m17.5 20h-15c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h15c.276 0 .5.224.5.5s-.224.5-.5.5z"/><path d="m15.5 24h-11c-1.378 0-2.5-1.121-2.5-2.5v-19c0-1.378 1.122-2.5 2.5-2.5h11c1.378 0 2.5 1.122 2.5 2.5 0 .276-.224.5-.5.5s-.5-.224-.5-.5c0-.827-.673-1.5-1.5-1.5h-11c-.827 0-1.5.673-1.5 1.5v19c0 .827.673 1.5 1.5 1.5h11c.827 0 1.5-.673 1.5-1.5v-4c0-.276.224-.5.5-.5s.5.224.5.5v4c0 1.379-1.122 2.5-2.5 2.5z"/><path d="m10.5 14c-.128 0-.256-.049-.354-.146-.195-.195-.195-.512 0-.707l7-7c.195-.195.512-.195.707 0s.195.512 0 .707l-7 7c-.097.097-.225.146-.353.146z"/><path d="m15.5 9c-.128 0-.256-.049-.354-.146l-2-2c-.195-.195-.195-.512 0-.707s.512-.195.707 0l2 2c.195.195.195.512 0 .707-.097.097-.225.146-.353.146z"/><path d="m12.5 12c-.128 0-.256-.049-.354-.146l-2-2c-.195-.195-.195-.512 0-.707s.512-.195.707 0l2 2c.195.195.195.512 0 .707-.097.097-.225.146-.353.146z"/><path d="m21.5 18c-.128 0-.256-.049-.354-.146l-3.29-3.29c-.195-.195-.195-.512 0-.707s.512-.195.707 0l3.29 3.29c.195.195.195.512 0 .707-.097.097-.225.146-.353.146z"/><path d="m15.5 16c-.675 0-1.303-.263-1.769-.741l-2.495-2.495c-.195-.195-.195-.512 0-.707s.512-.195.707 0l2.5 2.5c.561.574 1.558.569 2.108.005l2.005-2.005c.288-.281.444-.654.444-1.057s-.156-.776-.438-1.052l-.131-.122-2.378-2.378c-.195-.195-.195-.512 0-.707s.512-.195.707 0l2.491 2.481c.486.475.749 1.103.749 1.778s-.263 1.303-.741 1.769l-1.995 1.995c-.461.473-1.089.736-1.764.736z"/></svg>',
          color: 'defects-icon-teal'
        },
        {
          title: 'Зависает / перезагружается',
          text: 'Сбои в программном обеспечении. Телефон может медленно работать, зависать при включении, циклично перезагружаться, могут отсутствовать какие-либо функции. В этом случае может помочь сброс до заводских настроек, если проблемы не исчезли, потребуется «перепрошивка» смартфона.',
          icon: '<svg viewBox="-94 0 438 438.344" xmlns="http://www.w3.org/2000/svg"><path d="m204.128906 0h-157.957031c-25.394531.0273438-45.972656 20.605469-46 46v346.34375c.027344 25.394531 20.605469 45.972656 46 46h157.957031c25.394532-.027344 45.972656-20.605469 46-46v-346.34375c-.027344-25.394531-20.605468-45.9726562-46-46zm0 426.34375h-157.957031c-18.769531-.019531-33.980469-15.230469-34-34v-25.386719h225.957031v25.386719c-.019531 18.769531-15.230468 33.980469-34 34zm34-366.855469h-27.046875c-3.316406 0-6 2.6875-6 6s2.683594 6 6 6h27.046875v283.46875h-225.957031v-283.46875h139.089844c3.3125 0 6-2.6875 6-6s-2.6875-6-6-6h-139.089844v-13.488281c.019531-18.769531 15.230469-33.980469 34-34h157.957031c18.769532.019531 33.980469 15.230469 34 34zm0 0"/><path d="m187.097656 59.488281h-11.023437c-3.3125 0-6 2.6875-6 6s2.6875 6 6 6h11.023437c3.3125 0 6-2.6875 6-6s-2.6875-6-6-6zm0 0"/><path d="m125.152344 375.777344c-11.527344 0-20.875 9.34375-20.875 20.871094 0 11.527343 9.34375 20.875 20.871094 20.875 11.527343 0 20.875-9.34375 20.875-20.871094-.015626-11.523438-9.351563-20.859375-20.871094-20.875zm0 29.746094c-4.902344 0-8.875-3.972657-8.875-8.875 0-4.898438 3.972656-8.871094 8.871094-8.871094 4.902343 0 8.875 3.972656 8.875 8.875-.007813 4.894531-3.976563 8.863281-8.871094 8.871094zm0 0"/><path d="m125.152344 166.585938c-16.808594 0-30.867188 7.136718-40.953125 16.101562l.453125-27.34375c.054687-3.3125-2.585938-6.046875-5.898438-6.101562h-.101562c-3.273438 0-5.945313 2.628906-6 5.902343l-.714844 42.917969c-.027344 1.628906.609375 3.195312 1.757812 4.34375 1.144532 1.15625 2.714844 1.792969 4.34375 1.753906h.191407c.226562.011719.453125.007813.679687-.007812l40.976563-.703125c3.3125-.027344 5.976562-2.734375 5.949219-6.046875-.027344-3.316406-2.734376-5.980469-6.050782-5.953125h-.097656l-27.753906.476562c8.148437-7.269531 19.671875-13.332031 33.21875-13.332031 29.46875 0 49.261718 25.46875 49.261718 49.257812 0 23.789063-19.796874 49.253907-49.261718 49.253907-32.144532 0-49.261719-28.609375-49.261719-49.257813 0-3.316406-2.6875-6-6-6s-6 2.683594-6 6c0 29.582032 24.617187 61.257813 61.261719 61.257813 36.644531 0 61.257812-31.675781 61.257812-61.257813 0-29.585937-24.613281-61.261718-61.257812-61.261718zm0 0"/></svg>',
          color: 'defects-icon-brown'
        }
      ]
    }
  }
}
</script>

<style scoped>
  .text-wrap {
    fill: none;
    position: absolute;
    top: 30px;
  }
  .defects-icon {
    width: 70px;
    height: auto;
  }
  .defects-icon-orange {fill: orange;}
  .defects-icon-blue {fill: blue;}
  .defects-icon-teal {fill: teal;}
  .defects-icon-brown {fill: brown;}
</style>
