<template>
  <v-container class="py-12">
    <div class="text-center display-1">
      Отзывы наших клиентов
    </div>
    <v-carousel
      height="250"
      hide-delimiters
    >
      <v-carousel-item
        v-for="(item, i) in items"
        :key="i"
        class="px-16"
        ripple
      >
        <v-sheet height="100%" class="px-16">
          <v-row
            class="fill-height"
            align="center"
            justify="center"
          >
            <v-col cols="12" md="3" class="text-center">
              <v-avatar size="100">
                <img :src="item.avatar">
              </v-avatar>
              <div class="pt-1 title">
                {{ item.name }}
              </div>
              <div class="pt-1 caption">
                {{ item.city }}
              </div>
            </v-col>
            <v-col class="body-1">
              {{ item.text }}
            </v-col>
          </v-row>
        </v-sheet>
      </v-carousel-item>
    </v-carousel>
  </v-container>
</template>

<script>
export default {
  data () {
    return {
      items: [
        {
          name: 'Наталья',
          text: 'Приехала на отдых и случайно уронила свой iPhone в воду. Очень расстроилась. Нашла в интернете сайт этого сервисного центра. Ребята настоящие профессионалы. И хотя случай был довольно сложный - за сутки всё починили за вполне приемлемую цену. Рекомендую.',
          avatar: '14.jpg',
          city: 'Москва'
        },
        {
          name: 'Николай Любимов',
          text: 'Смартфон завис и выключился в самый неподходящий момент. Приехал специально из загородного пансионата в сервис. Хорошо, что удачно расположен - рядом с автовокзалом - быстро нашёл. Мастер посмотрел, сказал программа слетела, прошивать надо. За полчаса всё сделали и даже все контакты сохранили, что для меня очень важно. Хорошая работа, спасибо.',
          avatar: '21.jpg',
          city: 'Пермь'
        },
        {
          name: 'Куличенко Светлана',
          text: 'Меняла в Сервис Мобил разбитый экран на iPhone 6. Поменяли все быстро, цены доступные. Все понравилось. ',
          avatar: '76.jpg',
          city: 'Харьков'
        },
        {
          name: 'Дмитрий',
          text: 'Мой Хуавей перестал заряжаться, всякие разные зарядки перепробовал - бесполезно. В сервисе посмотрели - разъём зарядки поломался. Поменяли, пока я на рынок ходил. Теперь отлично заряжается. Хорошая мастерская.',
          avatar: '47.jpg',
          city: 'Санкт-Петербург'
        },
        {
          name: 'Елена',
          text: 'На свой iPhone только здесь смогла поменять батарею. В других местах какие ни ставили - плохо держит заряд. А в Сервис Мобил заказали оригинальную, поменяли - теперь никаких проблем, хорошо держит.',
          avatar: '53.jpg',
          city: 'Керчь'
        },
        {
          name: 'Михаил',
          text: 'Ситуция стандартная. Уронил телефон, треснул экран, тачскрин не работает. В Сервис Мобил дисплеи на мою модель были в наличии. Всё подробно рассказали, показали. Не так просто, оказывается, на моём телефоне экран поменять. В течение часа сделали - от заводского не отличить. Всё очень аккуранто. Цена за скорость и качество вполне нормальная, считаю.',
          avatar: '85.jpg',
          city: 'Москва'
        }
      ]
    }
  }
}
</script>
